Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_InitialAutoProxyTimeout.Description
source: Only applicable when wsl2.autoProxy is set to true. Configures how long (in milliseconds) WSL will wait for retrieving HTTP proxy information when starting a WSL container. If proxy settings are resolved after this time, the WSL instance must be restarted to use the retrieved proxy settings.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.autoProxy nastavena na hodnotu true. Konfiguruje, jak dlouho (v milisekundách) WSL počká na načtení informací o proxy serveru HTTP při spuštění kontejneru WSL. Pokud se nastavení proxy serveru po této době vyřeší, musí se instance WSL restartovat, aby se použila načtená nastavení proxy serveru.
da_dk: Gælder kun, når wsl2.autoProxy er indstillet til sand. Konfigurerer, hvor længe (i millisekunder) WSL venter på at hente HTTP-proxyoplysninger, når en WSL-objektbeholder startes. Hvis proxyindstillingerne fortolkes efter dette tidspunkt, skal WSL-forekomsten genstartes for at bruge de hentede proxyindstillinger.
de_de: Gilt nur, wenn „wsl2.autoProxy“ auf „TRUE“ festgelegt ist. Konfiguriert, wie lange (in Millisekunden) WSL beim Starten eines WSL-Containers auf das Abrufen von HTTP-Proxyinformationen wartet. Wenn die Proxyeinstellungen nach dieser Zeit aufgelöst werden, muss die WSL-Instanz neu gestartet werden, um die abgerufenen Proxy-Einstellungen zu verwenden.
el_gr: Ισχύει μόνο όταν το wsl2.autoProxy έχει οριστεί σε true. Διαμορφώνει τον χρόνο (σε χιλιοστά του δευτερολέπτου) που θα περιμένει το WSL για την ανάκτηση πληροφοριών του διακομιστή μεσολάβησης HTTP κατά την εκκίνηση ενός κοντέινερ WSL. Αν οι ρυθμίσεις του διακομιστή μεσολάβησης επιλυθούν μετά από αυτόν τον χρόνο, η παρουσία του WSL πρέπει να επανεκκινηθεί για να χρησιμοποιήσει τις ανακτημένες ρυθμίσεις.
es_es: Solo es aplicable cuando wsl2.autoProxy se establece en true. Configura el tiempo (en milisegundos) que WSL esperará para recuperar la información del proxy HTTP al iniciar un contenedor de WSL. Si la configuración de proxy se resuelve después de este tiempo, la instancia de WSL debe reiniciarse para usar la configuración de proxy recuperada.
fi_fi: Käytettävissä vain, kun wsl2.autoProxy-asetuksena on tosi. Määrittää, kuinka kauan (millisekunteina) WSL odottaa HTTP-välityspalvelintietojen noutamista WSL-säilöä käynnistettäessä. Jos välityspalvelimen asetukset ratkeavat tämän ajan kuluttua, WSL-esiintymä on käynnistettävä uudelleen, jotta noudetut välityspalvelimen asetukset voidaan käyttää.
fr_fr: Applicable uniquement lorsque wsl2.autoProxy a la valeur true. Configure la durée (en millisecondes) pendant laquelle WSL attend la récupération des informations du proxy HTTP au démarrage d’un conteneur WSL. Si les paramètres de proxy sont résolus après cette heure, le instance WSL doit être redémarré pour utiliser les paramètres de proxy récupérés.
hu_hu: Csak akkor alkalmazható, ha a wsl2.autoProxy igaz értékre van állítva. Konfigurálja, hogy a WSL mennyi ideig (ezredmásodpercben) várja meg a HTTP-proxyadatok lekérését a WSL-tároló indításakor. Ha ezt követően feloldja a proxybeállításokat, a WSL-példányt újra kell indítani a lekért proxybeállítások használatához.
it_it: Applicabile solo quando wsl2.autoProxy è impostato su true. Consente di configurare per quanto tempo (in millisecondi) WSL attenderà il recupero delle informazioni sul proxy HTTP all'avvio di un contenitore WSL. Se le impostazioni proxy vengono risolte dopo questo periodo di tempo, è necessario riavviare l'istanza di WSL per utilizzare le impostazioni del proxy recuperate.
ja_jp: wsl2.autoProxy が true に設定されている場合にのみ適用されます。WSL コンテナーの開始時に WSL が HTTP プロキシ情報の取得を待機する時間 (ミリ秒) を構成します。この時間が経過した後にプロキシ設定が解決された場合、取得したプロキシ設定を使用するには、WSL インスタンスを再起動する必要があります。
ko_kr: wsl2.autoProxy true로 설정된 경우에만 적용할 수 있습니다. WSL 컨테이너를 시작할 때 WSL에서 HTTP 프록시 정보를 검색할 때까지 대기하는 시간(밀리초)을 구성합니다. 이 시간 후에 프록시 설정이 확인되면 검색된 프록시 설정을 사용하려면 WSL instance 다시 시작해야 합니다.
nb_no: Gjelder bare når wsl2.autoProxy er satt til sann. Konfigurerer hvor lenge (i millisekunder) WSL skal vente på henting av HTTP-proxyinformasjon når du starter en WSL-beholder. Hvis proxy-innstillingene løses etter dette tidspunktet, må WSL-forekomsten startes på nytt for å bruke de hentede proxy-innstillingene.
nl_nl: Alleen van toepassing wanneer wsl2.autoProxy is ingesteld op true. Hiermee configureert u hoe lang (in milliseconden) WSL wacht op het ophalen van HTTP-proxygegevens bij het starten van een WSL-container. Als de proxyinstellingen na deze tijd worden omgezet, moet het WSL-exemplaar opnieuw worden gestart om de opgehaalde proxyinstellingen te gebruiken.
pl_pl: Ma zastosowanie tylko wtedy, gdy wsl2.autoProxy ma wartość true. Konfiguruje, jak długo (w milisekundach) protokół WSL będzie czekać na pobranie informacji o serwerze proxy HTTP podczas uruchamiania kontenera WSL. Jeśli ustawienia serwera proxy zostaną rozwiązane po tym czasie, wystąpienie WSL musi zostać uruchomione ponownie, aby można było użyć pobranych ustawień serwera proxy.
pt_br: Aplicável somente quando wsl2.autoProxy é definido como verdadeiro. Configura por quanto tempo (em milissegundos) o WSL aguardará pela recuperação de informações de proxy HTTP ao iniciar um contêiner WSL. Se as configurações de proxy forem resolvidas após esse período, a instância do WSL deverá ser reiniciada para usar as configurações de proxy recuperadas.
pt_pt: Apenas aplicável quando wsl2.autoProxy está definido como verdadeiro. Configura durante quanto tempo (em milissegundos) o WSL aguardará pela obtenção de informações de proxy HTTP ao iniciar um contentor WSL. Se as definições de proxy forem resolvidas após este período, a instância WSL tem de ser reiniciada para utilizar as definições de proxy obtidas.
ru_ru: Применимо, только если для wsl2.autoProxy установлено значение ИСТИНА. Определяет, как долго (в миллисекундах) WSL будет ждать получения информации о HTTP-прокси при запуске контейнера WSL. Если параметры прокси-сервера разрешены по истечении этого времени, экземпляр WSL необходимо перезапустить, чтобы использовать полученные параметры прокси-сервера.
sv_se: Gäller endast när wsl2.autoProxy har angetts till true. Anger hur länge (i millisekunder) WSL ska vänta på att HTTP-proxyinformation hämtas när en WSL-behållare startas. Om proxyinställningarna matchas efter den här tidpunkten måste WSL-instansen startas om för att använda de hämtade proxyinställningarna.
tr_tr: Yalnızca wsl2.autoProxy true olarak ayarlandığında geçerlidir. WSL kapsayıcısını başlatırken WSL'nin HTTP ara sunucusu bilgilerini almak için beklediği süreyi (milisaniye cinsinden) yapılandırır. Ara sunucu ayarları bu süreden sonra çözülürse, alınan ara sunucu ayarlarını kullanmak için WSL örneğinin yeniden başlatılması gerekir.
zh_cn: 仅当 wsl2.autoProxy 设置为 true 时适用。配置启动 WSL 容器时 WSL 等待检索 HTTP 代理信息的时间（以毫秒计）。如果在此时间后解析到代理设置，则必须重新启动 WSL 实例才能使用检索到的代理设置。
zh_tw: 僅適用於 wsl2.autoProxy 設為 true 時。設定 WSL 啟動 WSL 容器時，WSL 等候擷取 HTTP Proxy 資訊的時間) (毫秒。如果在此時間之後解析 Proxy 設定，則必須重新啟動 WSL 實例，才能使用擷取的 Proxy 設定。

# Settings_InitialAutoProxyTimeoutResetButton.Content
source: Reset timeout
cs_cz: Resetovat časový limit
da_dk: Nulstil timeout
de_de: Timeout zurücksetzen
el_gr: Επαναφορά χρονικού ορίου
es_es: Restablecer tiempo de espera
fi_fi: Palauta aikakatkaisu
fr_fr: Réinitialiser le délai d’expiration
hu_hu: Időtúllépés alaphelyzetbe állítása
it_it: Reimposta timeout
ja_jp: タイムアウトのリセット
ko_kr: 초기화 시간 제한
nb_no: Tilbakestill tidsavbrudd
nl_nl: Time-out voor opnieuw instellen
pl_pl: Limit czasu resetowania
pt_br: Redefinir tempo limite
pt_pt: Repor tempo limite
ru_ru: Сброс времени ожидания
sv_se: Återställ tidsgräns
tr_tr: Zaman aşımını sıfırla
zh_cn: 重置超时
zh_tw: 重設逾時

# Settings_InitialAutoProxyTimeoutTextBox.AutomationProperties.Name
source: Initial Auto Proxy timeout
cs_cz: Časový limit počátečního automatického proxy serveru
da_dk: Indledende timeout for automatisk proxy
de_de: Timeout für den anfänglichen automatischen Proxy
el_gr: Αρχικό χρονικό όριο του Auto Proxy
es_es: Tiempo de espera inicial del proxy automático
fi_fi: Alkuperäinen automaattisen välityspalvelimen aikakatkaisu
fr_fr: Délai d’expiration initial du proxy automatique
hu_hu: Kezdeti automatikus proxy időtúllépése
it_it: Timeout proxy automatico iniziale
ja_jp: 初期のオートプロキシ タイムアウト
ko_kr: 초기 자동 프록시 시간 제한
nb_no: Første tidsavbrudd for automatisk proxy
nl_nl: Time-out voor eerste automatische proxy
pl_pl: Limit czasu początkowego automatycznego serwera proxy
pt_br: Tempo limite inicial do Proxy Automático
pt_pt: Tempo limite inicial do Proxy Automático
ru_ru: Начальное время ожидания автоматического прокси-сервера
sv_se: Tidsgräns för inledande automatisk proxy
tr_tr: İlk Otomatik Ara Sunucu zaman aşımı
zh_cn: 初始自动代理超时
zh_tw: 初始自動 Proxy 逾時

# Settings_InitialAutoProxyTimeoutTextBox.AutomationProperties.HelpText
source: Only applicable when wsl2.autoProxy is set to true. Configures how long, in milliseconds, WSL will wait for retrieving HTTP proxy information when starting a WSL container. If proxy settings are resolved after this time, the WSL instance must be restarted to use the retrieved proxy settings.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.autoProxy nastavena na hodnotu true. Konfiguruje, jak dlouho (v milisekundách) WSL počká na načtení informací o proxy serveru HTTP při spuštění kontejneru WSL. Pokud se nastavení proxy serveru po této době vyřeší, musí se instance WSL restartovat, aby se použila načtená nastavení proxy serveru.
da_dk: Gælder kun, når wsl2.autoProxy er angivet til true. Konfigurerer, hvor længe WSL i millisekunder venter på at hente HTTP-proxyoplysninger, når en WSL-objektbeholder startes. Hvis proxyindstillingerne fortolkes efter dette tidspunkt, skal WSL-forekomsten genstartes for at bruge de hentede proxyindstillinger.
de_de: Gilt nur, wenn „wsl2.autoProxy“ auf „TRUE“ festgelegt ist. Konfiguriert, wie lange (in Millisekunden) WSL beim Starten eines WSL-Containers auf das Abrufen von HTTP-Proxyinformationen wartet. Wenn die Proxyeinstellungen nach dieser Zeit aufgelöst werden, muss die WSL-Instanz neu gestartet werden, um die abgerufenen Proxy-Einstellungen zu verwenden.
el_gr: Ισχύει μόνο όταν το wsl2.autoProxy έχει οριστεί σε true. Διαμορφώνει τον χρόνο, σε χιλιοστά του δευτερολέπτου, που θα περιμένει το WSL για την ανάκτηση πληροφοριών του διακομιστή μεσολάβησης HTTP κατά την εκκίνηση ενός κοντέινερ WSL. Αν οι ρυθμίσεις του διακομιστή μεσολάβησης επιλυθούν μετά από αυτόν τον χρόνο, η παρουσία του WSL πρέπει να επανεκκινηθεί για να χρησιμοποιήσει τις ανακτημένες ρυθμίσεις.
es_es: Solo es aplicable cuando wsl2.autoProxy está establecido en true. Configura el tiempo, en milisegundos, que WSL esperará para recuperar la información del proxy HTTP al iniciar un contenedor de WSL. Si la configuración de proxy se resuelve después de este tiempo, la instancia de WSL debe reiniciarse para usar la configuración de proxy recuperada.
fi_fi: Käytettävissä vain, kun wsl2.autoProxy-asetuksena on tosi. Määrittää, kuinka kauan (millisekunteina) WSL odottaa HTTP-välityspalvelintietojen noutamista WSL-säilöä käynnistettäessä. Jos välityspalvelimen asetukset ratkeavat tämän ajan kuluttua, WSL-esiintymä on käynnistettävä uudelleen, jotta noudetut välityspalvelimen asetukset voidaan käyttää.
fr_fr: Applicable uniquement quand wsl2.autoProxy a la valeur true. Configure la durée, en millisecondes, pendant laquelle WSL attend la récupération des informations du proxy HTTP au démarrage d’un conteneur WSL. Si les paramètres de proxy sont résolus après cette heure, l’instance WSL doit être redémarrée pour utiliser les paramètres de proxy récupérés.
hu_hu: Csak akkor alkalmazható, ha a wsl2.autoProxy igaz értékre van állítva. Konfigurálja, hogy a WSL mennyi ideig (ezredmásodpercben) várja meg a HTTP-proxyadatok lekérését a WSL-tároló indításakor. Ha ezt követően feloldja a proxybeállításokat, a WSL-példányt újra kell indítani a lekért proxybeállítások használatához.
it_it: Applicabile solo quando wsl2.autoProxy è impostato su true. Configura per quanto tempo, in millisecondi, WSL attenderà il recupero delle informazioni sul proxy HTTP all'avvio di un contenitore WSL. Se le impostazioni proxy vengono risolte dopo questo periodo di tempo, è necessario riavviare l'istanza di WSL per utilizzare le impostazioni del proxy recuperate.
ja_jp: wsl2.autoProxy が true に設定されている場合にのみ適用されます。WSL コンテナーの開始時に WSL が HTTP プロキシ情報の取得を待機する時間をミリ秒単位で構成します。この時間が経過した後にプロキシ設定が解決された場合、取得したプロキシ設定を使用するには、WSL インスタンスを再起動する必要があります。
ko_kr: wsl2.autoProxy가 true로 설정된 경우에만 적용할 수 있습니다. WSL 컨테이너를 시작할 때 WSL에서 HTTP 프록시 정보 검색을 기다리는 시간(밀리초)을 구성합니다. 이 시간 후에 프록시 설정이 확인되면 검색된 프록시 설정을 사용하려면 WSL 인스턴스를 다시 시작해야 합니다.
nb_no: Gjelder bare når wsl2.autoProxy er satt til sann. Konfigurerer hvor lenge WSL i millisekunder venter på å hente HTTP-proxyinformasjon når en WSL-beholder startes. Hvis proxy-innstillingene løses etter dette tidspunktet, må WSL-forekomsten startes på nytt for å bruke de hentede proxy-innstillingene.
nl_nl: Alleen van toepassing wanneer wsl2.autoProxy is ingesteld op true. Hiermee configureert u hoe lang in milliseconden door WSL wordt gewacht op het ophalen van HTTP-proxygegevens bij het starten van een WSL-container. Als de proxyinstellingen na deze tijd worden omgezet, moet het WSL-exemplaar opnieuw worden gestart om de opgehaalde proxyinstellingen te gebruiken.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.autoProxy ma wartość true. Określa, jak długo w milisekundach podsystem WSL będzie oczekiwać na pobranie informacji o serwerze proxy HTTP podczas uruchamiania kontenera WSL. Jeśli ustawienia serwera proxy zostaną rozpoznane po tym czasie, należy ponownie uruchomić wystąpienie podsystemu WSL, aby można było użyć pobranych ustawień serwera proxy.
pt_br: Aplicável somente quando wsl2.autoProxy está definido como true. Configura por quanto tempo, em milissegundos, o WSL aguardará pela recuperação de informações de proxy HTTP ao iniciar um contêiner WSL. Se as configurações de proxy forem resolvidas após esse período, a instância do WSL deverá ser reiniciada para usar as configurações de proxy recuperadas.
pt_pt: Apenas aplicável quando wsl2.autoProxy está definido como verdadeiro. Configura durante quanto tempo, em milissegundos, o WSL aguardará pela obtenção de informações de proxy HTTP ao iniciar um contentor WSL. Se as definições de proxy forem resolvidas após este período, a instância WSL tem de ser reiniciada para utilizar as definições de proxy obtidas.
ru_ru: Применимо, только если для wsl2.autoProxy установлено значение ИСТИНА. Определяет, как долго (в миллисекундах) WSL будет ждать получения информации о HTTP-прокси при запуске контейнера WSL. Если параметры прокси-сервера разрешены по истечении этого времени, экземпляр WSL необходимо перезапустить, чтобы использовать полученные параметры прокси-сервера.
sv_se: Gäller endast när wsl2.autoProxy har angetts till true. Anger hur länge WSL i millisekunder ska vänta på att HTTP-proxyinformation hämtas när en WSL-container startas. Om proxyinställningarna matchas efter den här tidpunkten måste WSL-instansen startas om för att använda de hämtade proxyinställningarna.
tr_tr: Yalnızca wsl2.autoProxy true olarak ayarlandığında geçerlidir. WSL kapsayıcısını başlatırken WSL'nin HTTP ara sunucusu bilgilerini almak için beklediği süreyi (milisaniye cinsinden) yapılandırır. Ara sunucu ayarları bu süreden sonra çözülürse, alınan ara sunucu ayarlarını kullanmak için WSL örneğinin yeniden başlatılması gerekir.
zh_cn: 仅当 wsl2.autoProxy 设置为 true 时才适用。配置启动 WSL 容器时 WSL 等待检索 HTTP 代理信息的时间，以毫秒为单位。如果在此时间后解析到代理设置，则必须重新启动 WSL 实例才能使用检索到的代理设置。
zh_tw: 僅適用於 wsl2.autoProxy 設為 true 時。設定啟動 WSL 容器時，WSL 將等候擷取 HTTP Proxy 資訊的時間，以毫秒為單位。如果在此時間之後解析 Proxy 設定，則必須重新啟動 WSL 實例，才能使用擷取的 Proxy 設定。

# Settings_KernelCommandLine.Header
source: Kernel Command Line
cs_cz: Příkazový řádek jádra
da_dk: Kernekommandolinje
de_de: Kernelbefehlszeile
el_gr: Γραμμή εντολών πυρήνα
es_es: Línea de comandos completa
fi_fi: Ytimen komentorivi
fr_fr: Ligne de commande du noyau
hu_hu: Kernel parancssora
it_it: Riga di comando del kernel
ja_jp: カーネル コマンド ライン
ko_kr: 커널 명령줄
nb_no: Kjernekommandolinje
nl_nl: Kernelopdrachtregel
pl_pl: Wiersz polecenia jądra
pt_br: Linha de Comando do Kernel
pt_pt: Linha de Comandos de Kernel
ru_ru: Командная строка ядра
sv_se: Kernel-kommandorad
tr_tr: Çekirdek Komut Satırı
zh_cn: 内核命令行
zh_tw: 核心命令列

# Settings_KernelCommandLine.Description
source: Additional kernel command line arguments.
cs_cz: Další argumenty příkazového řádku jádra.
da_dk: Yderligere argumenter for kernekommandolinjen.
de_de: Zusätzliche Kernelbefehlszeilenargumente.
el_gr: Πρόσθετα ορίσματα γραμμής εντολών πυρήνα (Kernel Command Line).
es_es: Argumentos adicionales de la línea de comandos del kernel.
fi_fi: Ytimen komentorivin lisäargumentit.
fr_fr: Arguments de ligne de commande de noyau supplémentaires.
hu_hu: További kernel parancssori argumentumok.
it_it: Argomenti aggiuntivi della riga di comando del kernel.
ja_jp: 追加のカーネル コマンド ライン引数。
ko_kr: 추가 커널 명령줄 인수입니다.
nb_no: Flere kjernekommandolinjeargumenter.
nl_nl: Aanvullende kernelopdrachtregelargumenten.
pl_pl: Dodatkowe argumenty wiersza polecenia jądra.
pt_br: Argumentos adicionais de linha de comando do kernel.
pt_pt: Argumentos adicionais da linha de comandos do kernel.
ru_ru: Дополнительные аргументы командной строки ядра.
sv_se: Ytterligare kernel-kommandoradsargument.
tr_tr: Ek çekirdek komut satırı bağımsız değişkenleri.
zh_cn: 额外的内核命令行参数。
zh_tw: 其他核心命令列引數。

# Settings_LocalhostForwarding.Header
source: Enable localhost forwarding
cs_cz: Povolit přeposílání localhost
da_dk: Aktivér videresendelse af localhost
de_de: Aktivieren der Weiterleitung des lokalen Hosts
el_gr: Ενεργοποίηση προώθησης localhost
es_es: Habilitar reenvío de localhost
fi_fi: Ota localhostin edelleenlähetys käyttöön
fr_fr: Activer le transfert localhost
hu_hu: Localhost-továbbítás engedélyezése
it_it: Abilita l'inoltro localhost
ja_jp: localhost 転送を有効にする
ko_kr: localhost 전달 사용
nb_no: Aktiver videresending av localhost
nl_nl: Localhost-doorsturen inschakelen
pl_pl: Włącz przesyłanie dalej hosta lokalnego
pt_br: Habilitar o encaminhamento de localhost
pt_pt: Ativar reencaminhamento localhost
ru_ru: Включить переадресацию локального узла
sv_se: Aktivera localhost-vidarebefordran
tr_tr: Localhost iletmeyi etkinleştir
zh_cn: 启用 localhost 转发
zh_tw: 啟用 localhost 轉送

# Settings_LocalhostForwarding.Description
source: Boolean specifying if ports bound to wildcard or localhost in the WSL 2 VM should be connectable from the host via localhost:port.
cs_cz: Logická hodnota určující, jestli se porty vázané na zástupný znak nebo localhost ve virtuálním počítači WSL 2 mají připojit z hostitele přes localhost:port.
da_dk: Boolesk værdi, der angiver, om porte, der er bundet til jokertegn eller localhost i WSL 2 VM, skal kunne forbindes fra værten via localhost:port.
de_de: Boolescher Wert, der angibt, ob die in der WSL 2-VM an den Platzhalter oder Localhost gebundenen Ports vom Host aus über „localhost:port“ erreichbar sein sollen.
el_gr: Τιμή boolean που καθορίζει αν οι θύρες που είναι δεσμευμένες σε χαρακτήρες μπαλαντέρ (wildcard) ή στο localhost εντός της Εικονικής Μηχανής WSL 2 θα πρέπει να μπορούν να συνδεθούν από τον κεντρικό υπολογιστή μέσω του localhost:θύρα.
es_es: Valor booleano que especifica si los puertos enlazados a un carácter comodín o localhost en la VM WSL 2 deben poder conectarse desde el host a través de localhost:port.
fi_fi: Totuusarvo, joka määrittää, tuleeko WSL 2 VM:n yleismerkkiin tai localhostiin sidottujen porttien olla yhdistettävissä isännästä localhost:portin kautta.
fr_fr: Booléen spécifiant si les ports liés à un caractère générique ou à un localhost dans la VM WSL 2 doivent pouvoir être connectés depuis l'hôte via localhost:port.
hu_hu: Logikai érték, amely azt határozza meg, hogy a WSL 2 virtuális gép helyettesítő karaktereihez vagy localhost eleméhez kötött portok csatlakoztathatók legyenek-e a gazdagépről a localhost:port használatával.
it_it: Valore booleano che specifica se le porte associate a caratteri jolly o localhost nella macchina virtuale WSL 2 devono essere connettibili dall'host tramite localhost:port.
ja_jp: WSL 2 VM のワイルドカードまたは localhost にバインドされたポートを localhost:port 経由でホストから接続できるかどうかを指定するブール値です。
ko_kr: WSL 2 VM의 와일드카드 또는 localhost에 바인딩된 포트를 localhost:port를 통해 호스트에서 연결할 수 있는지 여부를 지정하는 부울입니다.
nb_no: Boolsk verdi som angir om porter som er bundet til jokertegn eller localhost i WSL 2 VM, skal kunne kobles til fra verten via localhost:port.
nl_nl: Booleaanse waarde die aangeeft of poorten zijn gebonden aan jokertekens of localhost in de WSL 2-VM, kunnen worden verbonden vanaf de host via localhost:port.
pl_pl: Wartość logiczna określająca, czy porty powiązane z symbolem wieloznacznym lub hostem lokalnym na maszynie wirtualnej WSL 2 powinny łączyć się z hosta za pośrednictwem hosta lokalnego localhost:port.
pt_br: Booliano que especifica se as portas associadas a curinga ou localhost na VM WSL 2 devem ser conectáveis do host via localhost:port.
pt_pt: Valor booleano que especifica se as portas vinculadas a "caráter universal" ou "localhost" na VM WSL 2 devem ser conectáveis a partir do anfitrião através de localhost:port.
ru_ru: Логическое значение, указывающее, должны ли порты, привязанные к подстановочному знаку или локальному узлу в виртуальной машине WSL 2, быть доступны для подключения с узла через localhost:port.
sv_se: Booleskt värde som anger om portar som är bundna till jokertecken eller localhost i den virtuella WSL 2-datorn ska kunna anslutas från värden via localhost:port.
tr_tr: WSL 2 VM'de wildcard veya localhost'a bağlı bağlantı noktalarının localhost:port üzerinden ana bilgisayardan bağlanıp bağlanamayacağını belirten boole değeri.
zh_cn: 布尔值，用于指定 WSL 2 VM 中绑定通配符或本地主机的端口是否应允许主机通过`localhost:端口号`进行连接。
zh_tw: 布林值，指定繫結至 WSL 2 VM 中萬用字元或 localhost 的連接埠是否應可透過 localhost:port 從主機連結。

# Settings_LocalhostForwardingToggleSwitch.AutomationProperties.Name
source: Enable localhost forwarding.
cs_cz: Povolte přeposílání localhost.
da_dk: Aktivér videresendelse af localhost.
de_de: Aktivieren Sie die Localhost-Weiterleitung.
el_gr: Ενεργοποίηση προώθησης localhost.
es_es: Habilitar reenvío de localhost.
fi_fi: Ota localhostin edelleenlähetys käyttöön.
fr_fr: Activez le transfert localhost.
hu_hu: Localhost-továbbítás engedélyezése.
it_it: Abilita l'inoltro localhost.
ja_jp: localhost 転送を有効にします。
ko_kr: localhost 전달을 사용하도록 설정합니다.
nb_no: Aktiver videresending av localhost.
nl_nl: Localhost-doorsturen inschakelen.
pl_pl: Włącz przesyłanie dalej hosta lokalnego.
pt_br: Habilitar o encaminhamento de localhost.
pt_pt: Ativar reencaminhamento do localhost.
ru_ru: Включить переадресацию локального узла.
sv_se: Aktivera localhost-vidarebefordran.
tr_tr: localhost iletmeyi etkinleştirin.
zh_cn: 启用 localhost 转发。
zh_tw: 啟用 localhost 轉送。
